{
  "songs": [
    {
      "title": "Steel-Toed Halo",
      "year": 1969,
      "description": "An early, defiant anthem establishing Rosie's core identity. It reframes femininity as armored strength, rejecting industry pressure to be soft and ornamental in favor of a \"grin-and-grit\" outlaw stance.",
      "style_and_production_notes": {
        "vibe": "Brisk two-step with a scuffed-up halo.",
        "tempo_feel": "4/4, ~122 BPM; dancehall drive.",
        "key_progression": "E major (E-A-E-B7).",
        "instrumentation": "Twangy Telecaster leads, walking bass, sawed fiddle, snappy snare with slap-back, baritone guitar doubling chorus hook. Gang shouts on the final title phrase."
      },
      "lyrics": "Verse 1: They said, “Sugar, take it easy, put some pearls where teeth should be Trade your boots for glass and glitter, let the boys hold up the key.” I said, “Glass is just a fracture looking for a place to land— I keep iron in my footsteps and a truth inside my hand.”\n\nChorus: I wear a steel-toed halo, scuffed and bright with sin If heaven wants me tidy, they can dust me when I’m in Don’t tell me how to walk or pray—just move and watch me go I wear a steel-toed halo and I don’t tiptoe.\n\nVerse 2: They pressed a corset ‘round a chorus, tried to cinch my every breath Said, “A lady hums in C and smiles herself to death.” I tuned my strings to thunder, let the barroom make it rain If pretty means obedient, baby—lose my name.\n\nChorus: I wear a steel-toed halo, righteous, rough, and true You bless the curb I jumped, I’ll bless the road I choose The gate is never narrow when a woman says it so I wear a steel-toed halo and I don’t tiptoe.\n\nBridge: If grace is just a whisper, find a louder church for me If faith can’t hold a woman’s weight, it ain’t the faith I need.\n\nFinal Chorus + Tag: I wear a steel-toed halo… Tag: Shine it with the miles I owe."
    },
    {
      "title": "Smile More, My Foot",
      "year": 1970,
      "description": "A head-on collision with the command to “smile,” delivered with wit, bite, and a walking exit. It’s a rally cry for agency on any stage, turning a demeaning request into a punchline.",
      "style_and_production_notes": {
        "vibe": "Barroom shuffle with a sharp-tongued smirk.",
        "tempo_feel": "4/4, ~108 BPM; boom-chuck groove.",
        "key_progression": "D major (D-G-D-A).",
        "instrumentation": "Boom-chuck acoustic, crisp snare, dobro side-comments, half-time bridge. Stacked harmony on the final chorus hook."
      },
      "lyrics": "Verse 1: Stagehand said, “Now smile, sweetheart, show the camera what it needs,” Then he handed me a ribbon for a mouth that doesn’t bleed I said, “Darlin’, I ain’t merchandise you shine beneath the lights— I bend steel bars with melodies and bite back when it bites.”\n\nPre-Chorus: You pin me in a frame and I’ll kick through the glass You ask me for a curtsy, I’ll deliver a pass.\n\nChorus: Smile more, my foot— I got a verse for that A heel-down, hard-truth, barroom thunderclap If you want a puppet, pull your own strings, son— Smile more, my foot; watch a bad girl run.\n\nVerse 2: They said, “Be sweet, don’t shorten men, keep sugar in your tone,” But sugar rots a good guitar and quiet breaks a bone I’ll sweeten when I choose it, not when you collect the dues If kindness is a muzzle here, I’ll sing the kind that bruises.\n\nChorus: Smile more, my foot— here’s a new decree I’ll keep my mouth wide open where the truth can breathe You want a photo? Take it while I’m gone— Smile more, my foot; I’m already movin’ on.\n\nBridge: If “difficult” means honest, let me be a storm If “ladylike” means smaller, I’ll be out of form.\n\nFinal Chorus + Spoken Tag: Smile more… (Spoken): That grin you want? Buy it at the five-and-dime. Mine’s busy singing."
    },
    {
      "title": "Put My Name on the Record",
      "year": 1971,
      "description": "A contracts-and-credits anthem demanding professional respect and ownership. Rosie turns the legal language of the music business into a sing-along, demanding her due as a creator, not just a performer.",
      "style_and_production_notes": {
        "vibe": "Mid-tempo train-beat protest song.",
        "tempo_feel": "4/4, ~112 BPM; relentless forward motion.",
        "key_progression": "G major (G-C-G-D).",
        "instrumentation": "Acoustic and tic-tac bass drive the rails, Telecaster chugs, pedal steel answers chorus lines. Background vocals echo the title like a union chant."
      },
      "lyrics": "Verse 1: You can dress me in your marketing and line me up like tins Count my breaths in billboard math and tally up the spins But if I carved the chorus, honey, penciled in the scars— Then stamp it like it matters: Produced by who we are.\n\nChorus: Put my name on the record, not a whisper, not in gray Same size type as all you men who get to walk away If I wrote it, if I bled it, if I tuned it ‘til it set— Put my name on the record, pay the woman what she’s owed.\n\nVerse 2: They said, “Be grateful for the salary, the spotlight, and the press,” But salary don’t kiss you back when lawyers make a mess I signed the art in callus, inked it with my throat Now write it in the credits where the money learns the note.\n\nChorus: Put my name on the record, bold enough to see A check with commas, sure—but start with dignity Don’t hide me in the chorus line while men collect the net— Put my name on the record, watch what equity begets.\n\nBridge: If ownership’s a prayer, then print is how it’s said A woman’s name is church bells when it’s rung in red.\n\nFinal Chorus + Tag: Put my name on the record… Tag: If truth is in the liner notes, I’ll finally sleep in peace."
    },
    {
      "title": "The Good Wife Clause (Talkin' Blues)",
      "year": 1972,
      "description": "A comic broadside that shreds the cultural and contractual \"fine print\" for women. Rosie uses the talkin'-blues format to turn patriarchal expectations into a punchline and liberation into a hook.",
      "style_and_production_notes": {
        "vibe": "Wry, talkin'-blues indictment with a sung-out chorus.",
        "tempo_feel": "4/4, ~100 BPM; barroom shuffle.",
        "key_progression": "D major (D-G-D-A).",
        "instrumentation": "Acoustic boom-chuck, dry snare crack, sly dobro commentary. Choruses bloom with stacked harmonies and unison fiddle."
      },
      "lyrics": "Verse 1 (Talkin'): They slid a paper ‘cross the table with a lot of pretty laws Said, “Here’s how you be loved, girl—sign the Good Wife Clause.” No cussin’, no fussin’, smile in every light Cook at five, sing at nine, hush when men are right. I said, “Boys, I read the fine print till my eyeballs hurt,” Then I signed—Rosie Walker—on the back of my own shirt.\n\nChorus (Sung): Tear up that Good Wife Clause I got my own first laws: Tell the truth, split the chores, pay me fair for what I’m for Tear up that Good Wife Clause— If love needs paperwork, we’re lost.\n\nVerse 2 (Talkin'): They said, “We’ll make exceptions if you sweeten up the hook— Swap the pistol for a teardrop, we can sell this look.” I said, “Boys, I ain’t your puppet, ain’t your porch-light prize My songs kick doors and sue the rules with melody and eyes.” They said, “Darlin’, don’t get angry,” with a salesman’s drawl— I said, “Darlin’, I ain’t angry—I’m just through with y’all.”\n\nChorus (Sung): Tear up that Good Wife Clause...\n\nBridge (Sung): If being “good” means being small I’ll be the “bad” that saves us all If being “sweet” means shut your mouth I’ll be the storm that rinses out.\n\nFinal Chorus + Tag (Spoken): Tear up that Good Wife Clause... I wasn’t born to take your pause. Tag (Spoken): Case closed."
    },
    {
      "title": "Shackles Off, Ring On",
      "year": 1973,
      "description": "Rosie’s declaration of independence from the Nashville machine. She frames her retreat from the spotlight not as a surrender, but as a strategic choice to marry her own principles—a powerful act of self-definition.",
      "style_and_production_notes": {
        "vibe": "Outlaw two-step meets front-porch boogie—sunny grit, not sweet.",
        "tempo_feel": "4/4, ~112 BPM; heel-and-toe dancefloor swing.",
        "key_progression": "A major (Verse: A-D-A-E; Chorus: A-E-F#m-D-A-E-A).",
        "instrumentation": "Acoustic rhythm, twangy Tele lead, fiddle fills, tic-tac bass, snare with light slap-back, handclaps in last chorus."
      },
      "lyrics": "Verse 1: Signed my name with a kitchen pen, flour dust on my jeans Hung my rhinestones on a nail, let the quiet wash me clean Kept the spark, lost the circus, I ain’t changin’ what I won— If heels were shackles yesterday, this ring’s my loaded gun.\n\nPre-Chorus: No choir needed, no big show— I’ll write my vows in mountain snow.\n\nChorus: Shackles off, ring on— I ain’t beggin’ to belong I married my own backbone, now watch me carry on If Nashville needs apologies, they’ll wait ‘til kingdom come— Shackles off, ring on; baby, that’s how freedom’s done.\n\nVerse 2: Paper says “Mrs.”, but the pilot’s seat says “me,” I’ll steer by coal-town starlight and a kitchen’s rosary Silence ain’t surrender, it’s a sharpened, holstered tongue— I didn’t quit; I picked my fight— and honey, I already won.\n\nBridge: They say the stage is where I live— I say a porch can shout and give If home’s a rebel state of mind Then sign me in and draw the line.\n\nDouble Chorus + Tags: Shackles off, ring on… I tuned my life, not just a song— Raise your glass to a brand-new dawn—shackles off, ring on."
    },
    {
      "title": "David (Born Red)",
      "year": 1973,
      "description": "A mountain-waltz battle cry for her newborn son. It’s a mother’s promise to raise a child to be resilient, righteous, and unbowed by a world that will try to bend him.",
      "style_and_production_notes": {
        "vibe": "Lullaby with brass knuckles.",
        "tempo_feel": "3/4, ~84 BPM; sway with a push.",
        "key_progression": "G major (Verse: G-C-G-D; Chorus: Em-C-G-D-G).",
        "instrumentation": "Fingerpicked acoustic, bowed fiddle, upright bass, brushed kit. Stacked harmonies on the chorus."
      },
      "lyrics": "Verse 1: Came in swingin’, little storm, fist full of coal-town air Told the nurse and God alike you’d take your proper share Mountain thunder in your cry, lightning in your tread— Son, I’ll teach you not to bow, only lift your head.\n\nChorus: You were born red, born ready, loud in a quiet room With a boot-kick heartbeat marchin’ like a union tune The world will try to bend your spine; make ‘em pay in truth instead— You were born right, born free—my David, born red.\n\nVerse 2: If a law is bent and blind, you don’t have to make it home Build a porch from busted rules, carve your name in stone Love’s a forge and life’s a hammer; sparks are not a sin— Hold the steel ‘til morning light and call the temper “win.”\n\nBridge: When the day shifts mean and long Count your breath and sing this song— If the gate won’t let you through Find a door and walk it true.\n\nFinal Chorus + Tag: Born red, born ready… Tag: Write your future big and steady."
    },
    {
      "title": "Kitchen-Table Strike Song",
      "year": 1974,
      "description": "A union-hall stomp that turns domestic tools into instruments of protest. It’s a song of grinning rage and communal strength, celebrating the working women who hold the county together.",
      "style_and_production_notes": {
        "vibe": "Cast-iron percussion and joyful defiance.",
        "tempo_feel": "4/4, ~102 BPM; stomp-stomp-clap pattern.",
        "key_progression": "D major (D-G-D-A).",
        "instrumentation": "Acoustic + baritone riff in unison, spoons/pots/pans percussion, snare on 2&4, harmonica stabs, gang vocals."
      },
      "lyrics": "Verse 1: I got a skillet for a bell and a picket sign for grace Flour dust like holy smoke on every stubborn face If the foreman wants our quiet, let him bargain with my pan— I’ll fry his pretty theory up and feed it to the band.\n\nChorus: Bang that pot, ring that bell— this kitchen is a union hall We don’t beg, we don’t crawl—this kitchen makes the final call You can sell your velvet promise; bring the ledger, nix the drawl— Bang that pot, ring that bell, we’re a union after all.\n\nVerse 2: Babies sleeping in the coats, coffee thick as oil We’re the hands that keep this county from collapsing in the soil “Wait your turn,” the bosses say; we say, “Turn about is due,” Put the numbers on the table, watch us total up what’s true.\n\nBridge: Make the rule, we read it through— If it’s crooked, we’ll make new Law ain’t holy if it lies— We’ll rewrite and notarize.\n\nDouble Chorus + Tag: Bang that pot… Tag: Our house, our rules, our pay."
    },
    {
      "title": "The Quiet Ain't a Cage",
      "year": 1976,
      "description": "A soft but firm declaration written a few years into her life as Judith Wilson. The song reframes her silence not as a prison, but as a chosen territory she rules with quiet strength, contrasting the noise of fame with the power of anonymity.",
      "style_and_production_notes": null,
      "lyrics": "(Music: A sparse, determined folk melody. Just a single acoustic guitar, played with a steady, unadorned rhythm. The sound of a woman humming to herself in an empty house.)\n\n(Verse 1)\nThey talk about the quiet like it's four walls and a lock\nLike it's the final, lonely tickin' of a busted kitchen clock\nThey think a voice gone silent is a voice that's been put down\nAnother good girl buried in a sleepy little town\nThey write their songs about the roar, the thunder, and the fame\nThey never learned the gospel of a woman's secret name.\n\n(Chorus)\nBut the quiet ain't a cage, son, it's a kingdom I have built\nFrom the dirt beneath my fingernails, the garden soil I've tilled\nIt's the space between the floorboards where I hide my own damn soul\nIt's the only thing in this whole world that I truly own and control\nSo let 'em sing their anthems 'bout breakin' iron bars\nThe quiet ain't a cage, son... it's a universe of stars.\n\n(Verse 2)\nOut there the noise is hungry, it'll eat you up alive\nIt'll take your truth and twist it just so its own damn lies survive\nIt'll put your pain on posters, it'll sell your blood for ink\nIt'll tell you what you're worth and it won't give you time to think\nI had my fill of thunder, I had my fill of rain\nI came back here to learn the sound of my own self again.\n\n(Chorus)\n'Cause the quiet ain't a cage, son, it's a kingdom I have built\nFrom the dirt beneath my fingernails, the garden soil I've tilled\nIt's the space between the floorboards where I hide my own damn soul\nIt's the only thing in this whole world that I truly own and control\nSo let 'em sing their anthems 'bout breakin' iron bars\nThe quiet ain't a cage, son... it's a universe of stars."
    },
    {
      "title": "Night-Shift Treaty",
      "year": 1979,
      "description": "A nocturnal outlaw shuffle about the unspoken contract between two working partners. It’s a tender but tough-jawed ode to shared burdens, where love is measured in sweat, mercy, and holding corporations to account.",
      "style_and_production_notes": {
        "vibe": "Tender jaw set tight.",
        "tempo_feel": "4/4, ~90 BPM; loping pocket groove.",
        "key_progression": "E minor (Em-C-G-D).",
        "instrumentation": "Tremolo electric, dobro slides, floor tom heartbeat, tic-tac bass, low fiddle drone. Hushed, up-close vocal."
      },
      "lyrics": "Verse 1: Steel-toed vows and a lunch-pail kiss, you clock where shadows bite I count your breaths by radiator hiss ‘til porch-light turns to light Our treaty ain’t on paper, babe— it’s sweat and mercy due If the mountain taxes lungs and love, we’ll bill ‘em back for you.\n\nChorus: Night-shift treaty, pay on time We won’t trade our life for grime If the dark demands its fee Bill the company, set us free.\n\nVerse 2: Clipboard saint says “sign right here,” the devil loves a line But I’ll keep tally in my bones—what’s yours is also mine We share the bruise, we share the bread, we share the stubborn dawn And when they cut the whistle short, we’ll sing this overtime.\n\nBridge: If a prayer can hold a roof, I’ll pray— But bolts and beams are how we stay Pay us fair and we’ll be kind Short us once— we’ll change your mind.\n\nFinal Chorus + Tag: Night-shift treaty… Tag: Signed in callus, sealed in spine."
    },
    {
      "title": "The Lines on Judith's Hands",
      "year": 1981,
      "description": "A folk ballad that treats the wrinkles and calluses on her hands as a secret map of a life lived in two worlds. Each line is a verse she never sang, a battle she won in silence, or a promise she kept to her family.",
      "style_and_production_notes": null,
      "lyrics": "(Music: A gentle, fingerpicked waltz. The melody is bittersweet and reflective, like tracing an old scar. It feels like a private history lesson.)\n\n(Verse 1)\nThe preachers talk of judgment written in a holy book\nBut the only truth I'll answer to is in a single look\nAt the road map of a life I've lived, right here in my own skin\nWhere every choice and consequence and secret sleeps within\nNot in the Nashville papers, not in the songs they play\nBut in the lines on Judith's hands at the closin' of the day.\n\n(Verse 2)\nThis scar right here's a broken jar when David had a fright\nThis callus is from buryin' my momma in the night\nThis wrinkle's from a laugh I had, so loud I couldn't breathe\nAnd this one's from a promise that I couldn't bear to leave\nEach one's a silent chord I struck, a note I didn't sing\nThe ghost of Rosie Walker in the life that Judith brings.\n\n(Chorus)\nOh, the lines on Judith's hands, they don't fade and they don't lie\nThey hold the weight of every truth I had to put aside\nThey're the price of Pikeville silence, they're the cost of being free\nThey're the only Hall of Fame that'll remember me\nA map of every battle that I won and that I lost\nAnd I trace 'em every evening and I understand the cost.\n\n(Outro)\nNo, you won't find 'em on a record\nYou won't find 'em on a stage\nJust in the lines on Judith's hands...\nTurnin' another page."
    },
    {
      "title": "Trickle-Down Drought",
      "year": 1984,
      "description": "A bitter, bluesy track responding to Reagan-era economics. From her Pikeville kitchen table, she observes the promises of wealth flowing upward while the ground in her community cracks from a lack of resources and opportunity.",
      "style_and_production_notes": null,
      "lyrics": "(Music: A gutbucket, angry blues shuffle. The guitar is played with a percussive, almost violent strum, punctuated by the sound of a foot stomping on a wooden porch.)\n\n(Verse 1)\nThe man on the TV, he's got hair you couldn't move\nSays the feast is for the rich man, puts the theory to the prove\nSays the table's gonna overflow with gravy, thick and sweet\nAnd the drippin's will rain down on us standin' in the street\nWell, I'm standin' in the kitchen, and I'm listenin' to that talk\nAnd the only thing that's tricklin' down is dust upon the walk.\n\n(Chorus)\nIt's a trickle-down drought, and the well is gettin' low\nThe big man sows his dollars, but the seeds of need don't grow\nHe builds his damn walls higher with every golden brick\nAnd he tells us that the comin' flood is just a salesman's trick\nBut the ground is crackin' open, and the roots are turnin' brown\nNothin' but a trickle-down drought in this forgotten town.\n\n(Verse 2)\nThey closed the Beckley mine last year, they shuttered up the mill\nThey say that's just the market turnin' on the hill\nThey say that cheaper labor's just the way the world now spins\nAnd you can't blame a rich man for the way he likes to win\nWell, you tell that to the widow with a cough that just won't quit\nAnd a stack of bills the company has totally forgot.\n\n(Chorus)\nIt's a trickle-down drought, and the well is gettin' low\nThe big man sows his dollars, but the seeds of need don't grow\nHe builds his damn walls higher with every golden brick\nAnd he tells us that the comin' flood is just a salesman's trick\nBut the ground is crackin' open, and the roots are turnin' brown\nNothin' but a trickle-down drought in this forgotten town."
    },
    {
      "title": "Boy with Matches",
      "year": 1988,
      "description": "A rockabilly-leaning mama-warning to a reckless son. It’s a tough-love sermon delivered with a grin, advising him to distinguish between purposeful fire and foolish flames.",
      "style_and_production_notes": {
        "vibe": "Tough-love swing.",
        "tempo_feel": "12/8, ~106 BPM; strut and sway.",
        "key_progression": "C major (C-F-C-G).",
        "instrumentation": "Slap upright bass, brushed snare shuffle, sun-baked Tele licks, honky-tonk piano jabs, handclaps."
      },
      "lyrics": "Verse 1: You want fireworks at noon, son, sparks to crown your head But kings get tried by daylight when the courthouse wants its bread So keep a hose beside your heart and eyes on where you aim You can light the world on purpose— don’t let foolish be your flame.\n\nChorus: Boy with matches, strike it wise Fire loves fools and pretty lies Burn the map if you must roam— Keep a bucket, call it home.\n\nVerse 2: Dare’s a velvet trap with teeth, the crowd will buy your fall They’ll cheer you from the rooftop then forget to break the wall If you want to jump, jump far and land where love is paid— Just don’t torch the bridge you built to bring your people shade.\n\nBridge: I ain’t here to fence you in— Just teach you how to fight and win Carry water, carry light— Make it bright and make it right.\n\nFinal Chorus + Tag: Boy with matches… Tag: Keep the flame, not the burn."
    },
    {
      "title": "Desert on the Evening News",
      "year": 1991,
      "description": "An anti-war hymn without a halo, written during the first Gulf War. With a reporter's snarl, Rosie rejects the sanitized, televised version of conflict and chooses a radical, domestic mercy instead.",
      "style_and_production_notes": {
        "vibe": "Minor-key half-time dirge.",
        "tempo_feel": "4/4, ~76 BPM; heavy backbeat.",
        "key_progression": "D minor (Dorian flavor).",
        "instrumentation": "Tremolo baritone guitar, organ pad, bowed cello, snare moving from brushes to sticks. High lonesome harmony on final chorus."
      },
      "lyrics": "Verse 1: They made a sky show out of bombs, synced it to a score Commentator calling plays like Friday night before If victory’s a TV word, then mercy’s off the grid I’ll raise a flag for every kid who did what grown men did.\n\nChorus: Turn it down, turn it off War ain’t gospel, pain ain’t cough If peace is weak in suits like these I’d rather weak than on my knees.\n\nVerse 2: Sand can swallow all our names and sell the dust as pride I won’t buy the fireworks when children learn to hide If blood becomes a ratings bump, then bless the switch we pull— I’ll teach my boy to love the world and call that beautiful.\n\nBridge (Spoken/Sung): (Spoken) “Count the cost.” (Sung) Count it twice. (Spoken) “Glory’s cheap.” (Sung) Life’s the price. (Spoken) “Change the frame.” (Sung) Change the news (Together) Choose the truth we choose.\n\nFinal Chorus: Turn it down… (cold stop)."
    },
    {
      "title": "Bill the Company (Homer’s Song)",
      "year": 1996,
      "description": "An outlaw-gospel stomp demanding restitution for a generation of miners lost to corporate negligence. Sung from the perspective of a grieving family member, it’s a furious, righteous invoice for stolen breath.",
      "style_and_production_notes": {
        "vibe": "Union-hall call-and-response with hellfire preaching.",
        "tempo_feel": "4/4, ~98 BPM; stomp-stomp/clap groove.",
        "key_progression": "D minor (Dm-Bb-F-C).",
        "instrumentation": "Baritone Tele, resonator slide, floor-tom/kick thump, tambourine, Hammond organ, gang vocals."
      },
      "lyrics": "Verse 1: Got a ledger full of coughing, forty winters past due date Doctors wrote “regrettable,” the check arrived too late I ain’t kneeling at your altar of acceptable lost men— Send the bill to the boss’s god and run it through again.\n\nChorus: Bill the company, add the years Interest paid in miner tears If you can count the tonnage, boys Count the lungs and count the fears.\n\nVerse 2: Company doctor says “now breathe”—black snow in July Clipboard mercy, rubber stamp, “sign here” then goodbye If your profits ride a rail car built on borrowed air Then cut a check for every breath that never made it there.\n\nBreakdown Verse: Twenty-nine lunch pails waitin’ where the pay window should be Whistle blows for ghosts again—call it “accident,” not me If bolts run hot and roof runs low, shut it down, make safe— You don’t pray a shaft to hold; you brace it, life by life.\n\nBridge: Don’t you dare say “cost of business”; business cost us you— I’ll sign in blood and underline: Pay the families what they’re due.\n\nDouble Chorus + Tag (A cappella): Bill the company… Send the bill to the boss’s god— and run it through again."
    },
    {
      "title": "The Color-Coded Gospel",
      "year": 1998,
      "description": "A sharp-witted critique of the rise of partisan cable news. The song portrays 24-hour news channels as new-age preachers, sorting the world into simple teams of saints and sinners while ignoring the complicated truths on the ground.",
      "style_and_production_notes": null,
      "lyrics": "(Music: A fast, cynical talking-blues. The rhythm is relentless and agitated, like someone flipping channels in frustration. The chords are simple and repetitive.)\n\n(Verse 1)\nUsed to be the gospel came from a man in a steeple\nPreachin' hellfire and damnation to the ordinary people\nNow the sermon's on the cable, twenty-four hours a day\nGot a logo in the corner tellin' you the righteous way\nGot a choir full of pundits all singin' from one book\nAnd if you dare to ask a question, you get a dirty look.\n\n(Chorus)\n'Cause it's the color-coded gospel, it's the sacred blue and red\nThey tell you who to love and who to wish was dead\nYou pick your holy station, you learn your holy script\nAnd you bless the ammunition that is loaded in the clip\nThere ain't no room for gray, son, there ain't no in-between\nJust the saints and the sinners on a television screen.\n\n(Verse 2)\nThey take a simple story 'bout a town that's full of hurt\nAnd they dress it up in party lines and drag it through the dirt\nThey find a man who's angry, they give his rage a name\nThey point him at his neighbor and they fan the holy flame\nAnd they call it news, and they call it fair, and they call it tellin' truths\nWhile they're poisonin' the water for the old folks and the youths.\n\n(Chorus)\n'Cause it's the color-coded gospel, it's the sacred blue and red\nThey tell you who to love and who to wish was dead\nYou pick your holy station, you learn your holy script\nAnd you bless the ammunition that is loaded in the clip\nThere ain't no room for gray, son, there ain't no in-between\nJust the saints and the sinners on a television screen."
    },
    {
      "title": "The Second Raising",
      "year": 1999,
      "description": "A tender but tired waltz about the experience of raising a grandchild when your own child cannot. It’s a song about the fierce, bone-deep love of a grandmother stepping in to break a cycle of pain and addiction.",
      "style_and_production_notes": null,
      "lyrics": "(Music: A hushed, weary waltz. The melody is tender but exhausted, like a lullaby sung after midnight. The guitar sounds gentle, but the chords are full of unresolved tension.)\n\n(Verse 1)\nThe books are on the nightstand that I read when you were small\nThe lines from Goodnight Moon are still remembered, after all\nBut the boy who heard those stories is a ghost inside this house\nAnd the cradle in the attic's rockin' with a brand new mouse\nI thought my work was finished, I thought my time was done\nBut I'm startin' my second raising with the son of my own son.\n\n(Chorus)\nAnd these hands that once held David are now holdin' little Alex\nAnd the lullabies I'd forgotten are the new collected works\nIt's a love that's fierce and ancient, it's a debt that's owed and paid\nIt's the promise that a grandmother to her own child has made\nYou fix the things that shattered, you mend the broken trust\nYou build a brand new childhood from the sorrow and the dust.\n\n(Verse 2)\nYour momma's fightin' demons that I do not know the name of\nAnd your daddy's chasin' phantoms in a world I'm not to blame for\nAnd it ain't my place to judge 'em, and it ain't my place to cry\nMy only job is standin' here and lookin' in your eye\nAnd showin' you a steady hand, a door that's always wide\nA place where you can come to put the stormy world outside.\n\n(Chorus)\nAnd these hands that once held David are now holdin' little Alex\nAnd the lullabies I'd forgotten are the new collected works\nIt's a love that's fierce and ancient, it's a debt that's owed and paid\nIt's the promise that a grandmother to her own child has made\nYou fix the things that shattered, you mend the broken trust\nYou build a brand new childhood from the sorrow and the dust."
    },
    {
      "title": "Ash on Church Street",
      "year": 2001,
      "description": "A hymn of Appalachian solidarity written in the immediate aftermath of 9/11. It is a plea for communal grief that refuses to be weaponized, choosing mercy and grace over anger and retaliation.",
      "style_and_production_notes": {
        "vibe": "Grief that refuses to be weaponized.",
        "tempo_feel": "6/8, ~78 BPM; stately sway.",
        "key_progression": "C major (C-F-C-G).",
        "instrumentation": "Fingerpicked acoustic, pump-organ pad, bowed fiddle, pedal steel swells. Small harmony trio on choruses."
      },
      "lyrics": "Verse 1: Ash on Church Street, sirens in the sky Names like rosary beads, we finger them and cry I lit the stove and set a plate for somebody I don’t know Said “If love can cross a county line, it sure can cross that smoke.”\n\nChorus: Hold the line, hold the light Don’t turn sorrow into fight If fear comes dressed in flags tonight We’ll choose mercy, we’ll choose right.\n\nVerse 2: TV men sell breaking hearts with countdowns in the crawl But I won’t buy their thunder if it means we learn to maul Send the blood and bread we can; send hands and not a cheer— Let grief make grace, not gasoline; keep cleansing what is dear.\n\nBridge: We’ll read the names like prayers, one breath for every friend And build a better way to live they’d recognize again If anger asks for fire, we’ll answer it with stone— Foundations we can stand upon when we walk wounded home.\n\nFinal Chorus + Tag: Hold the line, hold the light… Tag: We’ll make a table out of night."
    },
    {
      "title": "Yellow Ribbon, Rusted Chain",
      "year": 2004,
      "description": "Written during the height of the Iraq War, this song revisits the anti-war themes of \"Desert on the Evening News\". It contrasts the patriotic imagery of support with the long, grinding reality of a protracted conflict and its human cost.",
      "style_and_production_notes": null,
      "lyrics": "(Music: A grim, marching folk song. The rhythm is heavy and deliberate, like boots on gravel. The melody is minor-key and mournful, a stark contrast to patriotic anthems.)\n\n(Verse 1)\nThe mayor gave a speech today down at the county square\nTied a yellow ribbon 'round the oak tree standin' there\nTalked of pride and sacrifice, of doin' what is right\nFor the boys we sent to battle in the everlastin' night\nAnd the crowd all waved their little flags and sang a sturdy song\nAnd nobody dared to ask him if the whole damn thing was wrong.\n\n(Chorus)\nOh, a yellow ribbon's pretty, but a rusted chain is real\nIt's the one that's tied to caskets made of Pennsylvania steel\nIt's the one that drags a mother from her bed and to her knees\nIt's the one that's wrapped around the ghosts of all our memories\nSo you can wave your ribbon, but you cannot hide the stain\nOf a yellow ribbon's promise and a rusted, bloody chain.\n\n(Verse 2)\nThey show us fuzzy pictures on the television news\nOf a town we've liberated from their own damn points of views\nThey don't show the children's faces, they don't show the mother's dread\nThey just show the victory columns and they count our noble dead\nThey sell it like a movie where the good guys always win\nBut the credits always roll before the real bad part begins.\n\n(Chorus)\nOh, a yellow ribbon's pretty, but a rusted chain is real\nIt's the one that's tied to caskets made of Pennsylvania steel\nIt's the one that drags a mother from her bed and to her knees\nIt's the one that's wrapped around the ghosts of all our memories\nSo you can wave your ribbon, but you cannot hide the stain\nOf a yellow ribbon's promise and a rusted, bloody chain."
    },
    {
      "title": "Two Cries, One Night",
      "year": 2005,
      "description": "A kitchen-gospel waltz written on the night her husband died and her grandson was born. It is a song of profound dualism—grief that swings its fist then lifts a prayer, finding a way to seed a future from devastating loss.",
      "style_and_production_notes": {
        "vibe": "Grief that swings its fist then lifts a prayer.",
        "tempo_feel": "6/8, ~72 BPM; rolling hymn.",
        "key_progression": "Bb major (Bb-Eb-Bb-F).",
        "instrumentation": "Pump-organ pad, acoustic arpeggios, brushed snare, pedal steel swells, small harmony choir."
      },
      "lyrics": "Verse 1: There were two cries in the night—one fading, one a flame Heaven kept a brighter star; the earth received a name I held a brand-new jawline with an old familiar fight Said, “Kid, the world just took its cut—now take back what is right.”\n\nChorus: Two cries, one night— love keeps books the law can’t see If sorrow writes the first line, joy can charge the fee I’ll raise you like a battle hymn and laugh at what ain’t fair— Two cries, one night— breathe loud and take your share.\n\nVerse 2: I won’t gild the wound with lies nor toast the dying light But I can seed a future field with what survives this night We’ll grow a mercy big enough to shade the things we’ve lost— Boy, your breath’s a down payment; I’ll cover all the cost.\n\nBridge: Bless the gone, bless the born— Bless the thorn that guards the corn Bless the debt we will out-sing— Bless the fight and what it brings.\n\nFinal Chorus + Tag: Two cries… Tag: Amen in denim; carry on."
    },
    {
      "title": "MawMaw's Cast-Iron Vow",
      "year": 2006,
      "description": "A protective, almost menacing lullaby for her grandson, Alex. The song is a promise, as sturdy and unbending as her skillet, to shield him from the world's harms and the family's ghosts.",
      "style_and_production_notes": null,
      "lyrics": "(Music: A dark, protective lullaby. Almost a whispered threat set to a gentle melody. The guitar is sparse, just a low, rumbling bass note on each beat, like a slow heartbeat.)\n\n(Verse 1)\nThe world is full of shadows, child, and men with hungry eyes\nThey'll see the light inside of you and tell you pretty lies\nThey'll try to take your kindness, they'll try to steal your flame\nThey'll try to make you carry the burden of their shame\nBut they don't know your grandma, and they don't know her law\nAnd they don't know the holy wrath of a Pikeville MawMaw.\n\n(Chorus)\nSo you sleep, my little Alex, you sleep the whole night through\n'Cause there ain't a thing in heaven or in hell can get to you\nThis skillet's old and heavy, but my aim is tried and true\nAnd MawMaw's cast-iron vow is to see no harm to you\nLet the monsters scratch the window, let the devil knock the door\nThey'll meet my cast-iron gospel... and they won't knock anymore.\n\n(Verse 2)\nThe ghosts of this old family, they like to walk the halls\nThey whisper bad ideas through the plaster of the walls\nThe ghost of your own daddy, with his anger and his thirst\nThe ghost of all the sorrow that made him feel he's cursed\nBut their power ends right here, boy, it stops right at your bed\n'Cause I'm standin' guard right over you to protect your heart and head.\n\n(Chorus)\nSo you sleep, my little Alex, you sleep the whole night through\n'Cause there ain't a thing in heaven or in hell can get to you\nThis skillet's old and heavy, but my aim is tried and true\nAnd MawMaw's cast-iron vow is to see no harm to you\nLet the monsters scratch the window, let the devil knock the door\nThey'll meet my cast-iron gospel... and they won't knock anymore."
    },
    {
      "title": "The Porch Light’s Out (But Wall Street’s Bright)",
      "year": 2008,
      "description": "A bar-room two-step with a smirk, written during the 2008 financial crisis. It’s a working-class ledger that contrasts Main Street’s struggles with Wall Street’s bailouts, served with a side of populist defiance.",
      "style_and_production_notes": {
        "vibe": "Working-class ledger punk.",
        "tempo_feel": "4/4, ~115 BPM; head-nod shuffle.",
        "key_progression": "E major (E-A-E-B7).",
        "instrumentation": "Snappy Tele, baritone doubling bass hook, tack-piano, fiddle stabs, four-on-the-floor kick."
      },
      "lyrics": "Verse 1: They said the market caught a cold, we oughta bless the rent Meanwhile Betty down the road’s on candles, heaven-sent If bailouts wear a Sunday suit, then mercy’s in a jar— We’ll pass the hat and pass the bill; we know just who you are.\n\nChorus: Porch light’s out, city’s bright Guess who’s payin’ for their flight Not the suits who rolled the dice— We’ll fix our town and set the price Porch light’s out, but we ain’t blind— Send the check, and sign the line.\n\nVerse 2: Banker calls it “act of God,” I call it “hands in pies,” Says “Main Street’s in our thoughts,” I say “spare us lullabies.” If you wanna preach about the risk we simple folks don’t get Explain the yacht and bonus checks; we’ll listen when they’re split.\n\nBridge: Trickle down don’t wet these crops— Turn it up and watch it stop We know math and we know need— Pay your tab and we’ll proceed.\n\nDouble Chorus + Button: Porch light’s out… (band hit on E)."
    },
    {
      "title": "The Man Who Carried Daylight",
      "year": 2009,
      "description": "Rosie’s song about Barack Obama’s election. It's not a simple celebration but a deeply empathetic ballad about the immense, almost impossible weight of hope that the nation placed on one man’s shoulders, and a prayer that the daylight he carried wouldn't burn him out.",
      "style_and_production_notes": null,
      "lyrics": "(Music: A slow, spare acoustic ballad in a minor key. The melody is more like a hymn than a country song—solemn and searching. The guitar is fingerpicked, leaving space for the words to land.)\n\n(Verse 1)\nThe television hummed a hymn I'd never heard before\nFrom a city built of marble, a thousand miles or more\nOut here the Pikeville dark was deep, with frost upon the glass\nI saw a promise breakin’ through, too bright and clean to last\nThey put the weight of ages and the hope of every slave\nRight in the hands of one good man, and told him to be brave\nThey handed him the daylight in a world of grays and blues\nAnd I said a prayer at my kitchen sink, watchin' the evenin' news.\n\n(Chorus)\nAnd oh, the Man Who Carried Daylight\nHe casts a shadow long and deep\nA crown of light is heavy, and the road is hard and steep\nFor every soul he’s lifted, there’s a stone he has to bear\nAnd the dawn ain't just a sunrise, Lord, it’s a burden and a prayer\nSweet Jesus, don’t let the morning break the man who brings the dawn.\n\n(Verse 2)\nI saw the lines on every face that stared up from the crowd\nWomen with their mothers' tears, sayin' his name out loud\nI saw the ghosts of picket lines, the backs that broke in mines\nLookin' for a single word to fix these crooked times\nThey poured their hurt and hunger, every debt they couldn't pay\nInto his voice, and trusted him to wash it all away\nOne man can’t hold a river back, no matter how he tries\nBut I saw that river risin’ up right there inside their eyes.\n\n(Chorus)\nAnd oh, the Man Who Carried Daylight\nHe casts a shadow long and deep\nA crown of light is heavy, and the road is hard and steep\nFor every soul he’s lifted, there’s a stone he has to bear\nAnd the dawn ain't just a sunrise, Lord, it’s a burden and a prayer\nSweet Jesus, don’t let the morning break the man who brings the dawn.\n\n(Bridge)\nNow, I know the sound of promises, the taste of pretty lies\nI know the wolves who gather when a good thing starts to rise\nThey’ll sharpen up their righteous knives on everything he speaks\nThey’ll count his faults like currency and prey upon the weak\nBecause the brightest light don't banish dark, it only makes it bold\nAnd a story 'bout a better world... is a dangerous one, I'm told.\n\n(Outro)\nSo God help the Man Who Carried Daylight\nThrough the long and comin' night...\nI shut the television off\nAnd just sat there in the quiet.\nHope he can handle all that light."
    },
    {
      "title": "Twenty-Nine Lunch Pails",
      "year": 2010,
      "description": "A slow, iron-spined lament for the victims of the Upper Big Branch mine disaster. Unlike the fiery rage of \"Bill the Company,\" this is a song of profound, marching sorrow that insists on bearing witness and demanding accountability through memory.",
      "style_and_production_notes": {
        "vibe": "Names withheld, truth not.",
        "tempo_feel": "4/4, ~78 BPM; heavy but marching.",
        "key_progression": "D minor (drop-D guitar).",
        "instrumentation": "Low-tuned acoustic, fretless bass, floor toms like distant blasts, mournful fiddle; no solos."
      },
      "lyrics": "Verse 1: Twenty-nine lunch pails sleeping under coal-black flags Twenty-nine hard hats hanging from their kids’ book bags If “accident” is corporate tongue for murder dressed in gloss Write the minutes in a widow’s hand and call the true word “loss.”\n\nChorus: Count them right, say their names Audit every hallway blame Safety ain’t a line to cut— Shut it down if bolts go strut.\n\nVerse 2: “Production goals,” the memo reads; the roof beam reads “not now.” You cannot pray a shaft to hold then break a sacred vow If time is money where you sit, our time was spent in skin— Add the years we won’t get back, and pay the living in.\n\nBridge: Bring the lights and bring the forms Walk the tunnels, feel the storms Stand where everything went wrong— Listen; that’s a safety song.\n\nFinal Chorus (Hushed Gang): Count them right… (fade)."
    },
    {
      "title": "Betty Stays",
      "year": 2012,
      "description": "A tender outlaw benediction, written as Rosie passes her treasured Martin D-28 guitar (\"Betty\") to her grandson, David. It’s a song about legacy, passing a torch, and the living truth embedded in an instrument.",
      "style_and_production_notes": {
        "vibe": "Passing a torch, not a relic.",
        "tempo_feel": "4/4, ~82 BPM; intimate pulse.",
        "key_progression": "D major (D-G-D-A).",
        "instrumentation": "Fingerpicked D-28, light pedal steel, brushed snare on choruses, upright bass blooms, small harmony “oohs.”"
      },
      "lyrics": "Verse 1: I swore I’d keep the case latched tight, let silence be my friend But a boy with thunder in his throat made that promise end Laid her gentle on your knee—old spruce, young fire— “Kid, the song will tell you when; just don’t call it liar.”\n\nChorus: Betty stays, but you can roam Make a stage out of this home If the world comes askin’ who— Say the mountains taught you true.\n\nVerse 2: Every scar upon this top is just a map of where we’ve been Every groove in rosewood grain remembers blood and grin Play it kind, play it mean, but mean it when you play— If the truth gets loud enough, it don’t have to beg to stay.\n\nBridge: When the neon hums like bees Tune your heart and bend your knees When the crowd leans in to hear— Let the quiet pull them near.\n\nFinal Chorus + Tag: Betty stays… Tag: Pick soft as a prayer, hard as rent."
    },
    {
      "title": "Pill-Bottle Prayer",
      "year": 2014,
      "description": "A stark, mournful hymn addressing the opioid crisis ravaging Appalachia. The song is a quiet indictment of corporate greed and a lament for the sons and daughters lost to a plague sold with a doctor's signature.",
      "style_and_production_notes": null,
      "lyrics": "(Music: A stark, broken hymn. The melody is almost entirely monotonous, a single, repeated line of grief. It sounds like it’s being sung in a church pew after everyone else has gone home.)\n\n(Verse 1)\nThe preacher talks of mansions, the doctor talks of cures\nOne sells you on the next life, one sells you on this world's\nOne writes it on a sermon note, one on a prescription pad\nBut they both make a good living from the hurtin' of the sad\nAnd the boys who worked the coal seam, with their busted backs and knees\nAre tradin' one black poison for another on the breeze.\n\n(Chorus)\nAnd it's a pill-bottle prayer on a Friday night\nA little piece of heaven in a blaze of white\nYou can buy your absolution for a thirty-dollar fee\nFrom a man with a diploma from the state of Tennessee\nLord, the only thing that's growin' in these hills of death and dust\nIs the graveyard and the profit margin of the ones we trust.\n\n(Verse 2)\nI see 'em in the grocery store, their eyes are dull and gone\nLike the lights are on inside the house, but nobody is home\nThey're the children of the mothers who once prayed I'd come to harm\nFor runnin' off to Nashville with a guitar on my arm\nNow they'd give their last damn dollar for a ticket out of here\nBut the only train that's runnin' is the one that's fueled by fear.\n\n(Chorus)\nAnd it's a pill-bottle prayer on a Friday night\nA little piece of heaven in a blaze of white\nYou can buy your absolution for a thirty-dollar fee\nFrom a man with a diploma from the state of Tennessee\nLord, the only thing that's growin' in these hills of death and dust\nIs the graveyard and the profit margin of the ones we trust."
    },
    {
      "title": "Murphy’s Neon Benediction",
      "year": 2015,
      "description": "A bar-gospel romper that finds holiness in the ruckus of a dive bar. It’s a joyful, clap-along celebration of the flawed, faithful, and forgotten, where the jukebox offers confession and mercy is served by the pour.",
      "style_and_production_notes": {
        "vibe": "Holy ruckus under a neon cross.",
        "tempo_feel": "4/4, ~108 BPM; clap-along chorus.",
        "key_progression": "G major (G-C-G-D).",
        "instrumentation": "Honky-tonk piano, claps, electric riffs, fiddle whoops, tambourine. Crowd-chant on final chorus."
      },
      "lyrics": "Verse 1: Neon cross above the till, drummer counting sin Kid walks in and rooms go still—heard that sound again If church won’t open doors for us, the jukebox will confess— Raise a glass and sing the truth; the good Lord likes a mess.\n\nPre-Chorus: Put your worries on the bar— We’ll buy grace by the jar.\n\nChorus: Neon benediction, bless this rickety crowd We ain’t pretty, we ain’t rich, but damn we’re singing loud If heaven tallies virtue points, we’ll let the angels score— I’ll take mercy in the melody and order one more pour.\n\nVerse 2: Tambourines in callused hands, prayers in boots and jeans Every chorus scrubs a stain the daylight never cleans If redemption needs a key, we’ll cut it out of noise— Turn the night to hallelujahs sung by barroom boys.\n\nBreakdown (Claps + Vocal): Say “Amen,” say it twice— Make the wrong notes sound like right.\n\nDouble Chorus + Shout Tag: Neon benediction… Tag: Last call for sinners—same as saints."
    },
    {
      "title": "Tin Crown King",
      "year": 2016,
      "description": "A snarling honky-tonk rocker and political broadside aimed squarely at the Trump presidency. It dismantles the performance of power, contrasting gold-leaf shine with sandpaper truth and serving as a rally cry for women refusing to kneel.",
      "style_and_production_notes": {
        "vibe": "Gold leaf meets sandpaper truth.",
        "tempo_feel": "4/4, ~124 BPM; two-step with teeth.",
        "key_progression": "E minor (Em-C-G-D).",
        "instrumentation": "Baritone Tele riff, driving snare/kick, slap-back vocal, fiddle stabs. Gang shouts on the hook."
      },
      "lyrics": "Verse 1: He’s got a tower full of mirrors and a mouth that sells the shine Paints his name on everything and calls it “golden spine.” But chrome don’t make a conscience and a crown don’t make a king— I’ve seen better men in denim do a more righteous thing.\n\nChorus: Tin crown king, you can’t buy my ring Gold leaf cracks when the truth starts to sing Raise your voice, girls—shake off that sting We don’t kneel to a tin crown king.\n\nVerse 2: He talks about our bodies like a billboard on his road Acts like power is a birthright and the rest of us are owed But sisters wrote a ledger he can’t bully or erase— Paid in songs and courtrooms—put that grin back in its place.\n\nBridge: No king but voters, no throne but ground No hush for bullies when the women gather ‘round We’ll teach our daughters how to laugh at little men— Truth wears boots; it wins in the end.\n\nDouble Chorus + Stop: Tin crown king… (band hit)."
    },
    {
      "title": "Signs in the Sink",
      "year": 2017,
      "description": "A joyful, porch-party protest song capturing the homespun energy on the eve of the Women’s March. It celebrates the multigenerational, grassroots organizing that turns kitchens into command centers and Sharpies into thunder.",
      "style_and_production_notes": {
        "vibe": "Stubborn, unstoppable joy.",
        "tempo_feel": "4/4, ~110 BPM; hip-sway shuffle with claps.",
        "key_progression": "D major (D-G-D-A).",
        "instrumentation": "Acoustic strum, Tele chicken-pickin', tack-piano, handclaps, tambourine. Gang “hey!”s on the chorus."
      },
      "lyrics": "Verse 1: Posterboard on the table, paint cups in the sink Grandgirls with the Sharpies writing bigger than they think Aunt May’s got the snacks lined up, Mama’s found the rhyme— If the boys say “bless your heart,” we’ll bless them back in time.\n\nPre-Chorus: We got boots and bus fare We got voices—come and dare.\n\nChorus: Signs in the sink, thunder in ink March in our blood and truth on the brink Hands in the air, country, beware— These women don’t need your permission to care.\n\nBreakdown (Chant + Claps): My body—my song! Your law—won’t wrong! Our town—stands strong!\n\nDouble Chorus + Tag: Signs in the sink… Tag: Put your feet where your heart’s been thinkin’."
    },
    {
      "title": "Not Your Song",
      "year": 2018,
      "description": "A slow-burn minor blues that turns testimony into a verdict. Written for the #MeToo movement, it’s a raw, unflinching reclamation of narrative, where a woman takes back her story from the man who tried to own and silence it.",
      "style_and_production_notes": {
        "vibe": "Testimony turned verdict.",
        "tempo_feel": "4/4, ~88 BPM; heavy pocket, spare words that land hard.",
        "key_progression": "B minor (Bm-G-D-A).",
        "instrumentation": "Dirty tremolo guitar, floor-tom thump, Hammond smolder, low fiddle moan. Stacked harmonies on the final chorus."
      },
      "lyrics": "Verse 1: You said “Smile, baby,” like a tip jar with a gun Closed the door behind your name and told me I was “fun.” But I ain’t your office rumor and I ain’t your alibi— I’m the verse that gets you sober when the chorus testifies.\n\nChorus: I am not your song, not your story to revise Not a chorus you can copyright or body you can prize I am not your hush, not your edit, not your “please”— Take your hands off what you never earned from me.\n\nVerse 2: You said “That’s just how he is,” like weather or a sneeze Asked me for a second chance then called your lawyer, “Please.” But I brought sisters with me and we don’t forget the tune— You can keep your open secrets; we’ll be singin’ truth by noon.\n\nBridge (Spoken/Sung): (Spoken) “Believe me.” (Sung) Believe us. (Spoken) “It’s over.” (Sung) It’s justice. (Spoken) “Just words.” (Sung) They cut, they cut.\n\nFinal Chorus + Out: I am not your song… (guitar growl to black)."
    },
    {
      "title": "Two Names, One Spine",
      "year": 2019,
      "description": "A bright, windows-down country song about Rosie’s dual identity as \"Walker\" the outlaw and \"Wilson\" the private citizen. It’s a joyful acceptance of a life lived in two worlds, held together by a single, unbending backbone.",
      "style_and_production_notes": {
        "vibe": "Acceptance with a wink.",
        "tempo_feel": "4/4, ~104 BPM; highway groove.",
        "key_progression": "A major (A-D-A-E).",
        "instrumentation": "Acoustic strum, lap steel melody, upright/tic-tac bass, hand percussion. Airy harmonies on the hook."
      },
      "lyrics": "Verse 1: Walker’s on the wind some nights, Wilson’s on the mail One name built the legend, one name baked the bread and kale I sign receipts with just a “J” and let the ledger guess— Two names share one backbone; either way, the truth says “yes.”\n\nChorus: Two names, one spine I bend but hold the line If I’m quiet, it’s by design— Two names, one spine.\n\nVerse 2: One girl walked off bright-lit stages, one girl shelled the peas Both girls hated cages and both answered, “No, thank you, please.” If you’re looking for the real me, check the groove and grain— Different labels on the jar; same good rebel jam remains.\n\nBridge: A secret ain’t a lie when it’s a door you had to choose— I traded maps for living rooms; that’s how I didn’t lose.\n\nDouble Chorus + Tag: Two names… Tag: Call me what you will—my backbone keeps the bill."
    },
    {
      "title": "Bottle’s Last Word",
      "year": 2020,
      "description": "A swamp-blues indictment of alcoholism's destructive power, written after losing a loved one. With grief and its sleeves rolled up, Rosie refuses to let the disease have the final say, vowing to write a louder, healthier legacy for the next generation.",
      "style_and_production_notes": {
        "vibe": "Grief with its sleeves rolled up.",
        "tempo_feel": "4/4, ~92 BPM; low swagger.",
        "key_progression": "A minor (Am-G-F-E7).",
        "instrumentation": "Dirty tremolo guitar, harmonica moan, floor tom/kick thud, Hammond smolder. Vocal starts close, gets feral in chorus."
      },
      "lyrics": "Verse 1: The bottle loves a final say, that bully on the shelf Spoke for you ‘til you were gone, and all you had was self Well death can keep his swagger; I won’t toast his hand— I’ll teach your boy a fight song and we’ll outlaw this demand.\n\nChorus: Bottle’s last word? Not in here We’ll write louder year by year If the past comes knockin’ drunk Lock the door; we ain’t that sunk Bottle’s last word— watch it fade We’ll speak life in what we play.\n\nVerse 2: I won’t eulogize your vice nor sanctify the ache But I will name the quiet love that helped me not to break We’ll build a fence of melody ‘round what the dark unmade— And cut a gate for daylight that the shadows can’t evade.\n\nBridge: Grief can drown or it can teach— We choose shore, we choose reach Pour it out, spill it plain— We’ll sing dry what whiskey claimed.\n\nFinal Chorus + Riff Tag: Bottle’s last word… (riff fades)."
    },
    {
      "title": "The Last Pot of Coffee",
      "year": 2021,
      "description": "A simple, poignant song written in her final years. It finds profound meaning in the small, daily rituals of life—brewing the last pot of coffee at night, checking the locks, and the quiet love of seeing a house through to the next morning. It's a farewell to the ordinary, which she fought so hard to have.",
      "style_and_production_notes": null,
      "lyrics": "(Music: A slow, simple, and accepting melody. It’s played with a light touch, like a final, quiet thought. The song ends with the sound of a single, fading guitar chord.)\n\n(Verse 1)\nThe house is breathin' quiet, the moon is on the sill\nThe day has spent its fury and the world is finally still\nThe dishes have been dryin', the back door's double-locked\nThe future of the universe can wait around the clock\n'Cause there's a sacrament of endings, a grace in gettin' through\nAnd it smells just like the last pot of coffee that I brew.\n\n(Verse 2)\nI measure out the grounds here, I pour the water slow\nAnd I think about the eighty years of what a person knows\nYou learn that love's a habit, and grief's a sturdy friend\nAnd most of what you worry on don't matter in the end\nYou learn a quiet kitchen holds more truth than any stage\nAnd life is just the turning of a slow and simple page.\n\n(Chorus)\nAnd oh, the final blessing is the ordinary thing\nThe hum of the refrigerator, the song the silence sings\nIt's the feelin' of the floorboards, cold and steady on your feet\nIt's the bitter and the beautiful, the strong and the sweet\nIt's knowin' that you're ready for whatever comes to be\nIn the time it takes to finish up the last pot of coffee.\n\n(Outro)\nYeah, the time it takes to finish up\nThe last pot of coffee... for me."
    },
    {
      "title": "Matchbook Will",
      "year": 2022,
      "description": "A last-page waltz, Rosie’s final statement. It’s a flinty farewell with a wink, asking not for mourning but for a spark. She frames her life's work as something to be ignited, not enshrined, a final act of outlaw grace.",
      "style_and_production_notes": {
        "vibe": "A hush that glows.",
        "tempo_feel": "3/4, ~70 BPM; quiet waltz.",
        "key_progression": "E minor (Em-C-G-D-Em).",
        "instrumentation": "Nylon-string or soft steel acoustic, sparse upright bass, brushed snare on beat 3, faint organ. No solos."
      },
      "lyrics": "Verse 1: Write my will on a matchbook, strike it when I’m gone Let the flame say what I meant when I played dumb too long If they come to buy my sorry, tell ‘em purchase light— I paid full price in silence, cashing out tonight.\n\nChorus: Light it up, let it burn What I kept is what I earned Ashes don’t explain a thing— That’s the outlaw in my ring.\n\nVerse 2: Leave a kiss on Betty’s top, a note for what to do: “Play the truth and count to ten; don’t let the truth count you.” If a door won’t open kind, knock twice and then be bold— Kick once for all the women who were told to do as told.\n\nBridge: If a song survives its singer, don’t you cage it for a sale— Play it loud for those who worked and those who made the bail.\n\nFinal Chorus + Single-Note Outro: Light it up… (one bell-like harmonic on E)."
    },
    {
      "title": "My Dear Alex",
      "year": 2022,
      "description": "Rosie's final song, found on the last page of her last notebook, written as a letter to her grandson Alex. It is a work of profound love and warning, a generational masterpiece that acknowledges the family’s ghosts, the poison of their past, and the immense, sacred weight of the gift Alex carries. It is not just a song; it is a last will and testament for the soul, passing the torch with a final, flinty blessing.",
      "style_and_production_notes": {
        "vibe": "A hymn recorded in a quiet room at dusk.",
        "tempo_feel": "3/4, ~68 BPM; a slow, stark waltz.",
        "key_progression": "C minor (Cm - G - Ab - Eb - G - Cm). The chords feel ancient and heavy, like a mountain ballad.",
        "instrumentation": "A single, starkly-mic'd acoustic guitar (her Gibson J-45), played with simple, resonant fingerpicking. A low cello drone enters on the second verse, holding a single note like a foundation of sorrow. The vocal is recorded dry and close, capturing every crackle and breath—not a performance, but a final, whispered confession."
      },
      "lyrics": "(Verse 1)\nMy dear Alex, you were born with a haunting in your bones\nA little bit of my light, and a shadow not your own\nYou carry your mother’s grace in the angle of your jaw\nAnd you’ve got your father’s sorrow, the kind that breaks the law\nThey’ll say your face is fortune, a gift from God above\nBut it’s just the pretty vessel for a hard and heavy love.\n\n(Verse 2)\nI have to speak of David now, the wolf that wore his face\nA broken chord, a hungry ghost who haunted this whole place\nHe drank until the man was gone and only anger stayed\nBut the violence in his history is a debt you’ve already paid\nYou do not have to carry him, you do not have to mend\nHis story was a dead-end road; your life is where it ends.\n\n(Chorus)\nSo you sing the ledger, boy, but you don't sing the lie\nYour heart’s a Pikeville holler, not a Music City sky\nLet ‘em see the ghost of me in every chord you strike\nBut God above, whatever you do, let the living man survive\nDon't let the song become a cage, the way I almost let it be\nThe world will try to own you. Don’t you let it, you hear me?\n\n(Verse 3)\nThey’ll come with pens and promises, they'll praise your raw-boned truth\nThey'll bottle up your righteous rage and sell it back to youth\nThey'll trade your soul for silver, then charge you for the shine\nThey'll say, \"Kid, you're a legend,\" while they're bleeding you dry\nBut a legend is a dead man that they can still command\nYou keep your feet on solid ground, with that guitar in your hand.\n\n(Bridge)\nYour face is not a fortune, your voice is not a brand\nThey're the hammer and the anvil God has laid inside your hand\nTo forge a better story than the one they gave to me\nThe only contract worth the ink is the one that sets you free\nYou tell the truth so loud and long it rattles all their teeth\nAnd you love the ones beside you, not the strangers underneath the stage.\n\n(Final Chorus)\nSo you sing the ledger, son, but you don't sing the lie\nYour heart’s a Pikeville holler, not a Music City sky\nLet ‘em see the ghost of me in every song you write\nBut God Almighty, Alex, you hold on to your own life\nDon't let the song become your cage, don’t let the legend win\nThe hardest note you'll ever hit is the man you are within.\n\n(Outro)\nSigned in coal dust, sealed in rust,\nYour MawMaw, who was dust.\nNow, go be the song.\n\n(A final, gently picked C minor chord rings out and fades to silence.)"
    },
    {
      "title": "My Dear Alex (A Deathbed Confession)",
      "year": 2022,
      "description": "This is not a song; it is a last will and testament for the soul. Found on a cassette tape in a small player by her bed, this is Rosie's final, fading message to her grandson, Alex. It is a raw, whispered confession, full of labored breaths and the weight of unspoken history. In it, she unburdens herself of the family’s ghosts—the violence, the fame, the sorrow—and offers a final, desperate plea for him to live a life free of the cages that defined her own. It is the most brilliant and devastating piece of writing she ever produced.",
      "style_and_production_notes": {
        "vibe": "A last breath, recorded on tape. Utterly raw.",
        "tempo_feel": "Pulseless. The song follows the rhythm of her breath, not a metronome.",
        "key_progression": "A few unsteady, open chords in C minor, played as if her fingers are too tired to form complex shapes. The guitar sometimes falls silent for several seconds.",
        "instrumentation": "Her old Gibson J-45, recorded on a simple cassette player. You can hear the creak of the bed, the rustle of sheets, and her soft, intermittent coughs. The vocal is a dry, cracked whisper, so close to the microphone it's almost inside the listener's head. There is no polish, no second take. This is it."
      },
      "lyrics": "(Spoken, over the sound of a tape recorder button clicking and a faint room hiss)\nAlex… lean in close now. This ain’t a song. It’s a map… of all the places you don’t ever have to go.\n\n(Verse 1 - sung, voice a fragile rasp over a barely-strummed Cm chord)\nMy dear Alex… my ghost is in your marrow\nA voice that ain’t your own, a path that’s steep and narrow\nYou got your mother’s Sunday smile, a kindness in the grain…\nBut you wear your father’s shadow like a hard and coming rain\nAnd they’ll call that pretty poison a gift from God above\nJust remember that it’s ballast… for a dark and heavy love.\n\n(A soft cough, a pause. The guitar finds an unsteady G chord.)\n\n(Verse 2 - more spoken than sung)\nI have to speak of David now… the devil in his blood\nHe drank to kill a part of me he never understood\nHe saw my ghost on every stage, heard it in every bar\nAnd he tried to beat the sound of it out of his guitar… and out of you.\nThat anger ain’t your bloodright, boy, it’s just a borrowed grave\nHe died so you could throw away the ugliest part he gave.\n\n(Chorus - the voice finds a flicker of old strength, a desperate clarity)\nSo you sing the ledger, son, but God, don’t sing the lie\nYour heart’s a Pikeville holler, not a Music City sky\nThat cage of gold and glitter, with its microphone and key…\nSon, it almost swallowed me whole. Don’t you let it swallow thee.\nThe world will want your sorrow. It will bid your pain up high.\nTell ‘em your soul ain’t for sale… and look ‘em in the eye.\n\n(Verse 3 - voice cracks, almost a whisper)\nThey’ll come with pens and promises, like wolves in smiling skin\nThey’ll praise the authentic way you bleed, then tell you where the bleedin’ should begin\nThey’ll take your bones for kindling to warm their own damn hands\nAnd they’ll call you a legend… ‘cause a legend takes commands\nBut you’re a man of dirt and bone, with calluses and doubt\nAnd that’s the only holy thing this song is all about.\n\n(Bridge - just voice, the guitar has fallen silent)\nSo you break the chain right here. You hear me, Alex?\nYou break it.\nYou owe that ghost of your father exactly nothing. You owe my ghost nothing.\nYour only debt is to the light inside your chest.\nYou pay that debt. You pay it every morning you wake up and choose not to be them.\n\n(Final Chorus - a final, ragged breath of melody)\nSo sing the ledger, boy… but never sing the lie…\nYour heart’s a Pikeville holler… beneath a real… sky…\nLet ‘em see the ghost of me… in every note you play…\nBut let the living, breathing man… be the one who walks away…\n\n(Outro - spoken, a final, fading whisper as the tape hisses)\nDon’t be the song… Alex. Be the man.\nLove… your MawMaw…\n\n(The sound of one last, slow exhale. The tape clicks off.)"
    }
  ]
}